cmsis-svd/cmsis-svd/data/Fujitsu/MB9B460R.svd
        <!-- REGISTER "OCU_OCSE3" -->
        <register derivedFrom="OCU_OCSE1">
          <name>OCU_OCSE3</name>
          <description>OCU ch.3 Control Register E</description>
          <addressOffset>0x134</addressOffset>
        </register>
        <!-- REGISTER "OCU_OCSE4" -->
        <register derivedFrom="OCU_OCSE0">
          <name>OCU_OCSE4</name>
          <description>OCU ch.4 Control Register E</description>
          <addressOffset>0x138</addressOffset>
        </register>
        <!-- REGISTER "OCU_OCSE5" -->
        <register derivedFrom="OCU_OCSE1">
          <name>OCU_OCSE5</name>
          <description>OCU ch.5 Control Register E</description>
          <addressOffset>0x13C</addressOffset>
        </register>
        <!-- REGISTER "OCU_OCFS10" -->
        <register>
          <name>OCU_OCFS10</name>
          <description>OCU ch.0/1 Connecting FRT Select Register</description>
          <addressOffset>0x168</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FSO1" -->
            <field>
              <name>FSO1</name>
              <description>Connects FRT ch.x to OCU ch.1</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FSO0" -->
            <field>
              <name>FSO0</name>
              <description>Connects FRT ch.x to OCU ch.0</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "OCU_OCFS32" -->
        <register derivedFrom="OCU_OCFS10">
          <name>OCU_OCFS32</name>
          <description>OCU ch.2/3 Connecting FRT Select Register</description>
          <addressOffset>0x169</addressOffset>
        </register>
        <!-- REGISTER "OCU_OCFS54" -->
        <register derivedFrom="OCU_OCFS10">
          <name>OCU_OCFS54</name>
          <description>OCU ch.4/5 Connecting FRT Select Register</description>
          <addressOffset>0x16A</addressOffset>
        </register>
        <!-- REGISTER "WFG_WFTF10" -->
        <register>
          <name>WFG_WFTF10</name>
          <description>Pulse Counter Value Register for WFG ch.0/1</description>
          <addressOffset>0x18E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "WFG_WFTA10" -->
        <register>
          <name>WFG_WFTA10</name>
          <description>WFG Timer Value Register for WFG ch.0/1</description>
          <addressOffset>0x190</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "WFG_WFTB10" -->
        <register>
          <name>WFG_WFTB10</name>
          <description>WFG Timer Value Register for WFG ch.0/1</description>
          <addressOffset>0x192</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "WFG_WFTF32" -->
        <register>
          <name>WFG_WFTF32</name>
          <description>Pulse Counter Value Register for WFG ch.2/3</description>
          <addressOffset>0x196</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "WFG_WFTA32" -->
        <register>
          <name>WFG_WFTA32</name>
          <description>WFG Timer Value Register for WFG ch.2/3</description>
          <addressOffset>0x198</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "WFG_WFTB32" -->
        <register>
          <name>WFG_WFTB32</name>
          <description>WFG Timer Value Register for WFG ch.2/3</description>
          <addressOffset>0x19A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "WFG_WFTF54" -->
        <register>
          <name>WFG_WFTF54</name>
          <description>Pulse Counter Value Register for WFG ch.4/5</description>
          <addressOffset>0x19E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "WFG_WFTA54" -->
        <register>
          <name>WFG_WFTA54</name>
          <description>WFG Timer Value Register for WFG ch.4/5</description>
          <addressOffset>0x1A0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "WFG_WFTB54" -->
        <register>
          <name>WFG_WFTB54</name>
          <description>WFG Timer Value Register for WFG ch.4/5</description>
          <addressOffset>0x1A2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "WFG_WFSA10" -->
        <register>
          <name>WFG_WFSA10</name>
          <description>WFG Control Register A for WFG ch.0/1</description>
          <addressOffset>0x1A4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x3FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DMOD" -->
            <field>
              <name>DMOD</name>
              <description>1specifies polarity for RTO(0) and RTO(1) signal outputs</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PGEN" -->
            <field>
              <name>PGEN</name>
              <description>specifies how to reflect the CH_PPG signal for each channel of the WFG</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PSEL" -->
            <field>
              <name>PSEL</name>
              <description>select the PPG timer unit to be used for each channel of the WFG</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "GTEN" -->
            <field>
              <name>GTEN</name>
              <description>selects the output conditions for the CH_GATE output signal of the WFG</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TMD" -->
            <field>
              <name>TMD</name>
              <description>select the WFG's operation mode</description>
              <lsb>3</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DCK" -->
            <field>
              <name>DCK</name>
              <description>set the count clock cycle for the WFG timer and Pulse counter</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WFG_WFSA32" -->
        <register derivedFrom="WFG_WFSA10">
          <name>WFG_WFSA32</name>
          <description>WFG Control Register A for WFG ch.2/3</description>
          <addressOffset>0x1A8</addressOffset>
        </register>
